Задача: "Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

**Описание решения:**

1. Задаем массив строк stringArray.
В качестве длины массива задается любое произвольное значение. Элементы массива имеют тип string.

2. Создаем массив miniArray[stringArray.Length].
Длина массива miniArray равно длине массива stringArray для того, что бы если все элементы массива stringArray окажутся < = 3, они бы уместились в массиве miniArray.

3. Сoздаем переменную int count = 0;
Эта переменная будет служить указанием индекса элементов массива miniArray.

4. Создаем переменную int size = 0;
Данная переменная нужна для исключения внутри кода не понятных и не постоянных цифр.

5. Создаем цикл for.
Цикл позволяет последовательно взять каждый элемент массива array для определения длины данного элемента. Выходим из цикла, как только проведен анализ длины последнего элемента.

6. Создаем условный оператор if.
Создаем его внутри цикла for. Данный оператор каждый элемент массива array сравнивает с size. Если сравнение соответствует условию задачи, то значению miniArray[Count] присваивается значение astringArray[i]. Переменную count увеличиваем на 1, что бы перейти к заполнению следующего не обозначенного элемента массива miniArray. После завершения цикла for, мы имеем массив miniArray с элементами, соответствующими условиям задачи. Следующие шаги позволят вывести его на экран.

7. Вывод массива miniArray на экран.
 Выводим массив на экран с помощью команды Console.Write.